package by.epam.introduction_to_java.unit04.simple_classes_and_objects.task06;

public class Task06 {
    public static void main(String[] args) {
        /*
        Составьте описание класса для представления времени. Предусмотрте возможности установки времени
        и изменения его отдельных полей (час, минута, секунда) с проверкой допустимости вводимых значений.
        В случае недопустимых значений полей поле устанавливается в значение 0. Создать методы изменения времени
        на заданное количество часов, минут и секунд.
         */
    }
}
